app/views/home/user.html.haml

        %td.change_role{:id => "#{a.id}"}
          = select("role", "val", ["admin","user"],:selected => a.roles.first.name)
---
SELECT  "roles".* FROM "roles" INNER JOIN "roles_users" ON "roles"."id" = "roles_users"."role_id" WHERE "roles_users"."user_id" = $1  ORDER BY "roles"."id" ASC LIMIT 1  [["user_id", 1]]
SELECT  "users".* FROM "users"   ORDER BY "users"."id" ASC LIMIT 1