app/controllers/categories_controller.rb

INSERT INTO "categories" ("created_at", "description", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-04-19 14:45:32.680831"], ["description", "nhvhjgu"], ["name", "hjguygyu"], ["updated_at", "2014-04-19 14:45:32.680831"]]
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save

UPDATE "categories" SET "description" = $1, "updated_at" = $2 WHERE "categories"."id" = 3  [["description", "amnaakjaklak"], ["updated_at", "2014-04-20 09:54:52.084783"]]
---
  def update
    respond_to do |format|
      if @category.update(category_params)

DELETE FROM "categories" WHERE "categories"."id" = $1  [["id", 2]]
---
  def destroy
    if current_user.role? :admin
      @category.destroy