app/controllers/home_controller.rb

  def user
    @users = User.all.reject{|u| u.email == "admin@admin.com" }
---
SELECT  "users".* FROM "users"   ORDER BY "users"."id" ASC LIMIT 1

  def change_role
    User.find(params[:id]).roles.first.update_attributes(:name => params[:role])
---
SELECT  "roles".* FROM "roles" INNER JOIN "roles_users" ON "roles"."id" = "roles_users"."role_id" WHERE "roles_users"."user_id" = $1  ORDER BY "roles"."id" ASC LIMIT 1  [["user_id", 2]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = 2  ORDER BY "users"."id" ASC LIMIT 1
UPDATE "roles" SET "name" = $1, "updated_at" = $2 WHERE "roles"."id" = 4  [["name", "admin"], ["updated_at", "2014-04-20 12:11:46.483179"]]