app/controllers/products_controller.rb

SELECT  "categories".* FROM "categories"  WHERE "categories"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "products" ("category_id", "created_at", "description", "name", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["category_id", 1], ["created_at", "2014-04-19 16:37:28.771336"], ["description", "rtrt"], ["name", "frert"], ["updated_at", "2014-04-19 16:37:28.771336"]]
---
  def create
    @category = Category.find(params[:category_id])
    @product = @category.products.new(product_params)

    respond_to do |format|
      if @product.save

DELETE FROM "products" WHERE "products"."id" = $1  [["id", 1]]
---
  def destroy
    if current_user.role? :admin
      @product.destroy